{"imDbId":"tt3896198","title":"Guardians of the Galaxy Vol. 2","fullTitle":"Guardians of the Galaxy Vol. 2 (2017)","type":"Movie","year":"2017","items":[{"username":"Platypuschow","userUrl":"https://www.imdb.com/user/ur57590728","reviewLink":"https://www.imdb.com/review/rw4103849","warningSpoilers":false,"date":"25 March 2018","rate":"9","helpful":"84 out of 110 found this helpful.","title":"Guardians of the Galaxy Vol. 2: Exceeds already high expectations","content":"Despite being a huge comic book nerd I was not familiar with the Guardians before the first movie came out. I did some googling and upon learning about this sci-fi superhero team consisting of a talking raccoon and tree man I was hardly impressed.I finally got round to watching the first film and was blown away. It had a remarkable charm that even the other Marvel titles didn't have. It was filled with great humour, memorable moments and fit into the Marvel Universe long running story perfectly.Because of this I pumped by expectations up high for the sequel to a degree where it was almost guaranteed to fail yet somehow, someway it didn't.Not only did it meet my expectations but it exceeded them, GotG2 is amazing.Full of the same five star humour, being a visual treat and once again with an excellent soundtrack the film gripped me from the outset and delivered that charm all over again.This time including several industry veterans including Kurt Russell (Who has been on great form since his return) and Sylvester Stallone they fit in well and don't detract from the franchise as I feared they might.With cameo appearances along the way from the likes of Farscape (1999) lead Ben Browder to industry legend Seth Green as Howard the Duck this is a fun rollercoaster ride than left me positively gagging for more.This is one of those films I feel like I could rant about (In a positive way) for a while and so I'm going to resist the urge and merely say that Guardians 2 is a contender for the best Marvel movie, contested only by the first Avengers film.Masterpiece.The Good:Cast are great againCharm returnsExcellent nostalgic soundtrackLooks amazingThe Bad:Only one movie with Baby Groot? Noooo!They seem to have dropped Drax's taking everything literal jokes awayMichael Rosenbaum was wastedThings I Learnt From This Movie:Batista should have skipped over wrestling and just been an actor"},{"username":"snoozejonc","userUrl":"https://www.imdb.com/user/ur120966602","reviewLink":"https://www.imdb.com/review/rw7342596","warningSpoilers":false,"date":"14 September 2021","rate":"8","helpful":"11 out of 12 found this helpful.","title":"Do me! Do me! Do me!","content":"Quill finds his real father.This is an enjoyable adventure with great humour and character moments.The story is pretty threadbare outside of the development of characters like Quill, Yondu, Ego, and Nebula but this provides enough entertainment on its own. Written into most scenes are strong themes about family and friendship. What it means to be a parent. Surrogate parents and families. Estranged children searching for parental figures and family.Of course it's all done with a great sense of humour, as characters like Drax, Mantis, Rocket, and Groot light up the screen with strong verbal and visual comedy.Quill doesn't massively develop as a character, but we do learn more about his origins and powers. Alongside this the Guardians are portrayed as developing a family dynamic. This is great idea given they are all depicted as coming from traumatic beginnings.Ego is an interesting character and fantastic visualisation of an outlandish graphic-novel concept. It is not particularly subtle, but the character epitomises an extreme version of the in-built selfish drives present in everyone. Kurt Russell is on great form.The contrasting father figure of Yondu is written particularly well. He has been portrayed as having egotistical characteristics too, but here is given a huge redemption arc with with moments of great altruism. It is great to see Michael Rooker playing this type of character. He is as stereotypically violent and generally aggressive as in his previous roles, but for once he gets to show some heart.Nebula and Gamora have solid moments of relationship development. These scenes all tie in well to the movie's main themes and are important to the overarching narrative of the MCU, particularly when watching The Avengers: Infinity War and Endgame. Karen Gillan and Zoe Zaldana both give strong performances, especially Gillan who is a consistently strong performer in the MCU.Visually it is a colourful feast for the eyes and full of exciting spectacle as you would expect from a space adventure. For me the CGI action is a little too much on occasions and distracts from the story, but doesn't spoil my enjoyment of the movie. It generally tells the story through its cinematography and editing. Being a Guardians movie it has a great soundtrack of course with many a well placed song."},{"username":"SebMoz","userUrl":"https://www.imdb.com/user/ur118818818","reviewLink":"https://www.imdb.com/review/rw6323887","warningSpoilers":false,"date":"30 November 2020","rate":"8","helpful":"44 out of 54 found this helpful.","title":"Yes. Just yes","content":"My god, I did not expect this movie to be this good. I am a big fan of the first Guardians of the Galaxy movie, and while I do think it is one of the better MCU movies, this one is just better in practically every way. The plot is well structured, and the pacing is great. The movie also explores its characters way more thoroughly than the previous one. The struggle of finding a place where you belong is a central theme, and every important character has their own struggles related to this. The performances are great as usual, every actor really brings their own flavor to their character. The movie also has great visuals, with all the wacky and fun ideas you might expect from a space movie. The action scenes are great, and the cgi is pretty flawless. The movie is also way funnier than any other MCU movie, with every character being a great source of humor. It's so much comedy being presented it's actually a little too much for me sometimes. Some of the characters feel like they exist only to be comic relief, even though they also have serious struggles that deserve a more serious treatment than they get. That is my only complaint though, as this is a movie with great plot, characters and visuals, as well as a fantastic climax, even though they pulled the whole \"saving the world\"-plot point again. This is one of my favorite MCU movies and space movies in general, it's a great time and I highly recommend it."},{"username":"aidanratesmovies","userUrl":"https://www.imdb.com/user/ur48282208","reviewLink":"https://www.imdb.com/review/rw7060403","warningSpoilers":false,"date":"24 June 2021","rate":"10","helpful":"9 out of 10 found this helpful.","title":"Fantastic","content":"It has its moments where it may crack a joke at the wrong time- but Guardians of the Galaxy Vol. 2 is easily one of the best sequels i've ever seen- and without a doubt- an absolute blast. I knew from the minute I saw the trailer for the first film that Guardians of the Galaxy was going to be something special, and the same thing applies to this film. We get the iconic characters back in all their glory, as well as some new ones. The entire cast is great, there is no doubting any of the main 5's performances, as they are simply as great as before. What I do enjoy about this film is how they decided to make Nebula less of a 2D character and really provide the depth they didn't have time for her character in the first film. We also get an excellent performance from Kurt Russell as the God Ego- as well as newcomer Pom Klementieff's hilarious portrayal of Mantis, and of course the brilliant Michael Rooker as Yondu. The soundtrack is great, obviously, and Gunn's direction is so excellently crafted and visually sound that you can't help but feel every aspect of emotion he is going for while making it. It's an incredibly funny film, with some great action scenes, and a deeply emotional turmoil that honestly made me cry once...or twice. The visuals are also fantastic, as well as the makeup, and the look of the film is incredibly well developed- as well as its style and atmosphere. In the end, Guardians of the Galaxy Vol. 2 is everything you would hope the sequel would be and more. It may not be quite as good as the original, but it certainly is more than a worthy successor.My Rating: 9.9/10."},{"username":"andreascaloni","userUrl":"https://www.imdb.com/user/ur129540860","reviewLink":"https://www.imdb.com/review/rw6696140","warningSpoilers":false,"date":"15 March 2021","rate":"8","helpful":"27 out of 33 found this helpful.","title":"GREAT SEQUEL","content":"The movie is full of heart , well directed and has some great messages as the first one but it is funnier than its predecessor. This can be sometimes an advantage and other times a disadvantage. Not quite as fresh as the original, but it's still a great triumph with one of the most emotionally impactful endings of any Marvel Cinematic Universe story. Guardians of the Galaxy Vol. 2 might not be as amazing as the first movie but it's a fun ride with characters we love.Rating: 7,9."},{"username":"daveh282001-893-288947","userUrl":"https://www.imdb.com/user/ur49723809","reviewLink":"https://www.imdb.com/review/rw6606263","warningSpoilers":true,"date":"17 February 2021","rate":"9","helpful":"21 out of 24 found this helpful.","title":"Great time!","content":"3 hour movies are usually too long. (Some movies are too long at any length). This movie seemed too short. The whole film is fun to watch. Most of the pacing, the story and the dialogue are excellent. The humor is actually funny and the characters, which were introduced in the first GG film, continue to be dynamic in this sequel. I actually cared about the characters. I especially liked Michael Rooker's An-du character, and his admission that he loves Quill like a son. Actually, the only ones who don't get a happy ending are the Cree & Ego. Great special effects too. 👍🏻👍🏻"},{"username":"ProjectAnomaly","userUrl":"https://www.imdb.com/user/ur105954145","reviewLink":"https://www.imdb.com/review/rw7054913","warningSpoilers":false,"date":"22 June 2021","rate":"9","helpful":"9 out of 10 found this helpful.","title":"Guardians of the Galaxy 2","content":"The stolen batteries thing at the start could have easily been written out of the movie, but it's otherwise really good. Love the father-son stuff."},{"username":"fanpepox","userUrl":"https://www.imdb.com/user/ur142575473","reviewLink":"https://www.imdb.com/review/rw7523397","warningSpoilers":false,"date":"7 November 2021","rate":"8","helpful":"9 out of 9 found this helpful.","title":"Reusing what worked with its predecesor while declining a little bit in plot quality.","content":"Guardians of the Galaxy Vol.2 plays it safe by repeating what made 2014's Guardians of the Galaxy a wonderful film, yet fails to amuse as much as its predecesor did. It's more colourful, more vibrant, more nonchalant and personal, but gives the sensation of relying too much on the popularity of the first film, with the same goofy characters doing goofy things and only a couple of them showing a real grow. Still a great experience, but not greater than the last one."},{"username":"AngelHonesty","userUrl":"https://www.imdb.com/user/ur60965299","reviewLink":"https://www.imdb.com/review/rw6437229","warningSpoilers":false,"date":"3 January 2021","rate":"9","helpful":"8 out of 9 found this helpful.","title":"Another Fantastic Marvel Movie","content":"It's hard to compete with the first movie of The Guardians of the Galaxy, the first was beyond good, setting the standards very high. This one falls a little short of the first giving us a cliché plot, but it's still an excellent film. The filming was amazing, the CGI top notch, the sound track was beautiful, the cast once again brought a spectacular performance and above all the jokes were fantastic. Guardians of the Galaxy Part two, explores some of the questions brought out in the first film, taking you deeper into the characters lives and personality. I loved the addition of Mantis to the team, the jokes between her and Drax are hilarious. I'm eager to see what they can do with the third installment."},{"username":"AnnaPagrati","userUrl":"https://www.imdb.com/user/ur68881398","reviewLink":"https://www.imdb.com/review/rw7293739","warningSpoilers":false,"date":"31 August 2021","rate":"10","helpful":"10 out of 12 found this helpful.","title":"I love it!","content":"Such a great sequel! Every Guardians movie is every better than the previous!"},{"username":"benjaminwest-242","userUrl":"https://www.imdb.com/user/ur122400466","reviewLink":"https://www.imdb.com/review/rw7404487","warningSpoilers":false,"date":"3 October 2021","rate":"8","helpful":"11 out of 13 found this helpful.","title":"A great sequel, comparable to the original","content":"Guardians of the Galaxy Vol. 2 is everything the audience could have hoped for. The same comedic atmosphere is applied, assisting the twists and turns that the plot employs. All the while, the emotional depth of the storyline is perfectly meaningful and helps set out the various messages of the film. The visual effects are yet again stunning and the fight scenes deliver. The movie capitalizes on another amazing soundtrack to accompany its wacky group of characters, whose respective cast members do extremely well giving life to."},{"username":"Reno-Rangan","userUrl":"https://www.imdb.com/user/ur20327151","reviewLink":"https://www.imdb.com/review/rw3830802","warningSpoilers":true,"date":"13 October 2017","rate":"8","helpful":"36 out of 55 found this helpful.","title":"Guardians' date with the creator.","content":"The first film was the most unexpected. That was one of the most colourfull space films I have ever seen. Youthful, energetic, fantastic visuals and so the same followed in this sequel as well. Not the same good, but stood to the expectation of the first film's success. This story does not have a great adventure in the galaxy. A simple quest, but a thrilling action-adventure. Now this accidental space gang is set to meet the creator.It's time for Peter to meet his father, Ego. As he still upset with his mother's death, his encounter with his father was not as expectedly smooth. On the other side of the story, Rocket, Yandu, Baby Groot make their escape from the captivity. They all end up on the Ego's planet where the rest of the film going to take place. Being the guardians of the galaxy, their fight against the whoever threaten the safety of the universe once again tested with their strength as a team.James Gunn did it again. And I'm confident that he's going to do the same for next as well. All the actors were fantastic like the previous film. This time, little fun with little Groot. Anybody who loved the first would love it too. Being a franchise from Marvel universe, it is yet to join the 'Avengers'. So far so good. I'm now expecting one of the best of best trilogies. Bring it on the volume 3.8/10."},{"username":"raiyans-98227","userUrl":"https://www.imdb.com/user/ur125836966","reviewLink":"https://www.imdb.com/review/rw7241726","warningSpoilers":false,"date":"18 August 2021","rate":"8","helpful":"10 out of 11 found this helpful.","title":"Romance , Nice ending","content":"I really enjoyed watching this movie. The family romance, the jokes, and the story, all works for me. The plot is good, all matches, quite makes sense. The most of it is the ending, very nice to close the film. 8/10 movie (personal rate)"},{"username":"nlgthunder","userUrl":"https://www.imdb.com/user/ur126457071","reviewLink":"https://www.imdb.com/review/rw7109764","warningSpoilers":false,"date":"10 July 2021","rate":"10","helpful":"8 out of 9 found this helpful.","title":"Just as good if not better than the first","content":"I think the Guardians installments to the MCU are some of the greatest. They're some of the most action packed with a family-centric storyline, strong characters, a lot of laughs, and excellent plots.Guardians 2 is magnificent much like its predecessor and one I could watch again and again."},{"username":"Morejambo54","userUrl":"https://www.imdb.com/user/ur112234773","reviewLink":"https://www.imdb.com/review/rw7303675","warningSpoilers":false,"date":"3 September 2021","rate":"8","helpful":"10 out of 12 found this helpful.","title":"James Gunns consistency","content":"Ridiculous, colourful and stupidly fun...it's just great! First off the movie is very funny, the humour is quite particular so if you don't like one joke you probably won't like the rest, but if you do it's hilarious! The comedy is actually well timed as well, it isn't thrown in at random points that disrupt the flow of the movie. The plot is also decent, it's not the best part of the film but definitely respectable. The section with the golden people(can't remember their names), while being a big part of the plot that is quite necessary, gets a bit repetitive with them constantly chasing the guardians. Much like the first movie I think the best part of this movie is the character. Undoubtedly what makes these movies so good is how well each character interacts with one another. Not only that but most of them have genuine development that has meaning that leaves the ending to be quite impactful. The movie excellently balances every character while leaving more room for them to grow and plenty of directions for future films. The villain is a bit mediocre, still works well and the acting by Kurt Russell really makes you hat the character...which is perfect. Oh and this movie looks absolutely beautiful, I never really noticed before but this movie was way ahead of its time...the camera work, the colours...everything is just amazing! Andddd the action :0 fabulousss."},{"username":"Stefan_Loves_Movies","userUrl":"https://www.imdb.com/user/ur116311545","reviewLink":"https://www.imdb.com/review/rw7185573","warningSpoilers":false,"date":"1 August 2021","rate":"9","helpful":"8 out of 9 found this helpful.","title":"#Movie Review","content":"Guardians of the Galaxy Vol. 2(2017) uses the same charming formula of the first movie, Fun & Action, and it works! This time around we actually get a deep emotional kick, learning more about the characters we all love while also adding depth to their personalities.Usually sequels struggle to reach the same level of the original movie since you kind of get used to the characters but I say that this movie is a success."},{"username":"welhof1","userUrl":"https://www.imdb.com/user/ur1343496","reviewLink":"https://www.imdb.com/review/rw7572642","warningSpoilers":false,"date":"22 November 2021","rate":"8","helpful":"9 out of 11 found this helpful.","title":"Fun, funny and actiony!","content":"Much like the first one this had a great mix of comedy and action. It was different than the other movies in the MCU but in a good way. I'm really curious how this fits in to the whole MCU but I'm sure they'll explain it."},{"username":"kaden_lewis","userUrl":"https://www.imdb.com/user/ur133484311","reviewLink":"https://www.imdb.com/review/rw7053034","warningSpoilers":false,"date":"21 June 2021","rate":"9","helpful":"9 out of 11 found this helpful.","title":"Guardians of the Galaxy Vol. 2","content":"This was a solid sequel. In my opinion, the first movie was at this point in 2017 was the third best in the universe, this was nothing like the first movie, but it was still great. This movie was a little bit better than the first movie in 1 way, this one gave me better laughs, especially the Mantis scene when she gave away Peter's deepest secret, I laughed so hard I was crying. Also the scene where Rocket, Groot, Yondu, and Kraglin jumped 177 systems and their faces became distorted was hilarious. Lastly, once again, Drax and his stupidity stole the show, he is just hilarious. This movie also had a good plot. I thought it was cool how they tied in Peter's issue with losing his mother and not knowing who his father is. The acting of the new addition, Mantis was great, I think Pom Klementieff played Mantis perfectly, it is a very unique character to play and she was great. Lastly, the final battle scene was really cool, I won't get into spoilers, but it was very unique.This movie wasn't as good as the first, but it was still great. I recommend this to anyone who wants to watch it, especially if you are a Baby Groot fan."},{"username":"joiningjt","userUrl":"https://www.imdb.com/user/ur84596117","reviewLink":"https://www.imdb.com/review/rw6733286","warningSpoilers":false,"date":"23 March 2021","rate":"10","helpful":"11 out of 15 found this helpful.","title":"The BEST sequel EVER to the BEST scifi EVER!! Absolutely PHENOMENAL!!!","content":"People always regard this as simply a comic book or super hero movie, it is based on a comic but is absolutely a phenomenal scifi , for me the best ever filmed!! James Gunn is obviously a scifi buff and I'm not sure if he actually knows this but I'm 60 years old and have seen them all from the great 1950s classics to the cheesy 1970s and 80s scifi and this without a doubt is the best ever made!! It puts it all together everything we've learned from the 40 plus years of scifi this one is the pinnacle!! Absolutely breathtakingly brilliantly filmed and executed. I cant add anymore than that but to say BRAVO, Villisamo!!!! Bring on part 3!!!!"},{"username":"BA_Harrison","userUrl":"https://www.imdb.com/user/ur0945066","reviewLink":"https://www.imdb.com/review/rw4676165","warningSpoilers":false,"date":"20 February 2019","rate":"5","helpful":"7 out of 9 found this helpful.","title":"Far too much lame humour.","content":"God-like space traveller Ego (Kurt Russell) reveals to Peter Quill (AKA Starlord) that he is his father and tries to convince his new-found son to become part of his plan to assimilate the entire universe.I'm one of the few who didn't enjoy the humour in the first Guardians of the Galaxy movie: I just didn't find it funny. So you can probably guess how I feel about Vol. 2, which ramps up the level of comedy even further. I can't say I'm disappointed that James Gunn won't be directing part three (although I do think he was treated very unfairly by those in charge).But Vol. 2 doesn't just suffer from an excess of bad gags: the plot is weak, the pop soundtrack is overbearing, at 136 minutes it's way too long, and the action is too far-fetched (even for a comic book sci-fi film featuring a talking raccoon and a dancing baby tree). Our heroes are thrown into numerous situations that would reasonably result in a very messy fate, yet they repeatedly manage to emerge unscathed. Suspending disbelief is one thing; accepting that a character can escape certain death time and time again is asking too much.Admittedly, Gunn has produced a film that looks great, with some mind boggling special effects and mesmerisingly beautiful scenes that make wonderful use of colour, but with such a silly plot and execution that frequently defies logic and the laws of physics, it's hard to care too much about what happens to the good guys.In short, this is the second best film to co-star Sylvester Stallone and Michael Rooker, Cliffhanger still clinging firmly on to first place.5/10, simply for sexy insect alien Mantis (Pom Klementieff) and tasty blue bald cyborg Nebula (Karen Gillan), both of whom make watching just about worthwhile."},{"username":"kosmasp","userUrl":"https://www.imdb.com/user/ur5876717","reviewLink":"https://www.imdb.com/review/rw3780183","warningSpoilers":false,"date":"14 August 2017","rate":"9","helpful":"15 out of 23 found this helpful.","title":"The sequel we've been looking for","content":"Of course the first one came completely from out of nowhere. Well not in a sense that no one knew the movie was being made or came out in the cinema. But no one expected anything from it. And it became this larger than life thing. With characters so well written and with just enough swagger and good dialog/one-liners, it's almost crazy that no one expected this would be great.So now it is expected, so how does it fair? Pretty good I'd say. We have established the characters, we know their traits and we can have fun. Even with conventions in general, breaking fourth walls and all (when it comes to love relationships for example). Of course if you haven't seen the first one, you may have issues with the movie. I've seen a couple of reviews where it was clear, they hadn't seen the first one. And while I do think this does work as a standalone, I'd say it may be risky when it comes to you liking this or not.The humor is there though and as we come to understand in the Marvel Universe, there are added scenes in and after the credits. Five in total to be exact! So sit back and enjoy them - if you had a good time watching the movie that is. Fantasy and comedy mixed with this great outcome: it's almost like you have to love it for it. Not to mention all the cameos"},{"username":"trevorguru","userUrl":"https://www.imdb.com/user/ur9016595","reviewLink":"https://www.imdb.com/review/rw6266368","warningSpoilers":false,"date":"13 November 2020","rate":"10","helpful":"16 out of 20 found this helpful.","title":"Laugh out loud","content":"Drax played by dave batista made me laugh out loud.. Even funny movies these days don't make people laugh at all. Action funny sad love respect everything in this"},{"username":"XweAponX","userUrl":"https://www.imdb.com/user/ur2366174","reviewLink":"https://www.imdb.com/review/rw7511815","warningSpoilers":false,"date":"5 November 2021","rate":"10","helpful":"9 out of 12 found this helpful.","title":"The Spirit of FARSCAPE lives here","content":"As does John Crichton, who is playing the Sovereign \"Admiral\"- complete with \"Peacekeeper\" NZ style accent. Peacekeepers were not gold, though.But one could make an argument that Peter Quill is a kind of John Crichton, and that Gamora is a type of Aeryn Sun (Gamora, like Aeryn, can lift up heavy objects with no problems at all). Peter Quill is an earthling who was snatched up by aliens, actually by Yondo, in much the same way John Crichton was sucked down a wormhole. So in some ways Peter is as out of place as John was during the 88 times we got to see him in the uncharted and tormented territories of space.We could even say that Drax is a stupider Ka D'argo and that Rocket is an equally funny Rygel, except that he is a raccoon rather than a helium-farting frog.Yondo can even be a Scorpius, Mantis a Chiana that is attracted to Drax/D'argo, Nebula a Jool or Shikozou.However you mix it up, the characters and the stories and the comedy is so much like Farscape. Actually come to think about it at the end of \"the peacekeeper wars\" which was the end of the Farscape franchise, John Crichton's Best friend is lost. Something similar to that happens in this film, and that just solidifies the relationship between the two franchises.It almost makes us want to see a Farscape sequel or a continuation produced by James Gunn because we know he would handle the property properly.As far as the freakin guardians of the galaxy (except I didn't say freakin'), this installment has so much more in it compared to the first one. Including Sylvester Stallone, David Hasselhoff, and some dope who has a name that is so funny that you can't stop giggling every time somebody says \"Taserface\"."},{"username":"cruise01","userUrl":"https://www.imdb.com/user/ur57691865","reviewLink":"https://www.imdb.com/review/rw3701913","warningSpoilers":true,"date":"6 May 2017","rate":"10","helpful":"45 out of 79 found this helpful.","title":"Guardians is back and has plenty of visuals and action. A great second chapter in GotG.","content":"Guardians of the Galaxy Vol. 2 is back and flashy as ever when it comes to its visual style of action, soundtrack, a fun cast, and the laughable humor. Usually sequels can be a let down after its predecessor set the standards high. And the build up momentum for the sequels is easily forgotten. Writer/Director James Gunn manages to continue what worked on the first movie and expand further with the characters he brought together. Yes, it is a ragtag of misfits that try to be a team and argue to each other with their own personal issues. In the end, they see each other not as friends but family. The plot follows Peter (Chris Pratt), Gamora (Zoe Saldana), Drax (Dave Bautista), Rocket (voiced by Bradley Cooper), and Baby Groot (voiced by Vin Diesel) are tasked at fighting away a giant monster and protecting valuable batteries. Ayesha (Elizabeth Debicki) the leader of the sovereign race, who needed the guardians help for the task. After a dispute, leaving the guardians on the run away from Ayesha and her army of drones chasing them away. The guardians crash on a planet, where they come across Ego (Kurt Russell) who is Peter's father. Ego takes Peter, Gamora, and Drax to his planet. Meanwhile, Rocket, Groot, and Nebula (Karen Gillan) stay behind their wrecked ship, only to come across the Ravagers led by Yondu (Michael Rooker). Trying to claim the bounty on the guardians that is set by Ayesha. Guardians of the Galaxy 2 has everything you can expect. It has plenty of action and the visual effects were colorful, and impressive. When Peter and his team visit Ego's planet. The visual effects were astonishing. The set pieces were great too. It does have its fun share of humor. It is fun to see a dysfunctional team trying to get along; you have Peter and Rocket with their arrogant cocky self. Nebula and Gamora personal conflict that keeps them fighting each other. The one thing that always drives Peter and his team is how they see each other as family. Also, there is baby groot which is always a scene stealer. Groot is small and cute, even from the opening moment of him dancing and needing music playing as the guardians are fighting against a giant monster. The villains are usually what worry me, as several Marvel movies later. They all have that same motive and have that cliché routine. I was worried for a second in this film about who and what the villain was. Without giving away spoilers or details. This film villain is by far better compared to the first movie. Definitely, the villain does not show until later. It definitely leads the direction into a big climax with the guardians trying to save the galaxy yet again. The guardians are tested personally as Peter, Gamora, and Drax are separated from Groot and Rocket being with Yondu. Gunn never lets a single moment become dull. There are easter eggs, celebrity cameos, etc. Also, there are five mid/post credit scenes that are worth checking out unlike the first movie end scene of Howard the Duck that was a waste. Overall, Guardians of the Galaxy Vol. 2 is a visually exciting sequel that surpasses the original. It has a fun cast and characters, the soundtrack is awesome, the visual effects and action is exciting, the villain is an interesting one, and James Gunn's fun direction makes it a flashy fun movie."},{"username":"jack_o_hasanov_imdb","userUrl":"https://www.imdb.com/user/ur55640799","reviewLink":"https://www.imdb.com/review/rw7274726","warningSpoilers":false,"date":"27 August 2021","rate":"8","helpful":"10 out of 14 found this helpful.","title":"Good","content":"This movie was just as fun as the first movie. Marvel does this very well. The casting was amazing. Mantis was also good.I liked it very much."}],"errorMessage":""}